{
  "apple apple scab": {
    "name": "Apple Scab",
    "treatment": "Apply fungicide early in the season.",
    "chemical": "Captan, Myclobutanil",
    "application": "For effective control of Apple Scab, the application of fungicides should commence early in the season, specifically at the critical stage of bud break. This initial spray is crucial for preventing the establishment of the fungal pathogen. Subsequent applications should follow a consistent schedule, typically every 7 to 10 days, throughout the period of primary scab infection, which usually extends from bud break until terminal shoot growth ceases. It's important to ensure thorough coverage of all leaf surfaces and developing fruit. Always refer to the specific product label for precise mixing instructions and re-entry intervals, as these can vary between different fungicide formulations.",
    "organic": "Neem oil, sulfur sprays"
  },
  "apple black rot": {
    "name": "Apple Black Rot",
    "treatment": "Prune infected branches and apply fungicide.",
    "chemical": "Copper-based fungicide",
    "application": "Initiate pruning of infected branches during the dormant season to remove overwintering fungal structures. In the spring, begin fungicide applications at bud break and continue through the petal fall stage, especially in wet conditions. Timely and thorough coverage is essential to protect new growth and developing fruit from infection. Remove any mummified fruit from the tree and the ground to reduce inoculum sources.",
    "organic": "Lime sulfur"
  },
  "apple cedar apple rust": {
    "name": "Cedar Apple Rust",
    "treatment": "Apply fungicide and remove nearby junipers.",
    "chemical": "Mancozeb, Myclobutanil",
    "application": "Fungicide applications are most critical during the period when fungal spores are being released from juniper galls and apple leaves are emerging, typically from bud break through the first few weeks after petal fall. Apply sprays every 10–14 days, particularly if there are susceptible juniper trees nearby or if weather conditions are favorable for disease development (wet and mild). Consider removing nearby junipers to significantly reduce disease pressure.",
    "organic": "Sulfur spray"
  },
  "apple healthy": {
    "name": "Healthy Apple",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain a healthy apple tree, continue regular monitoring for any signs of pests or diseases. Implement routine cultural practices such as annual pruning to ensure good air circulation within the canopy and remove any dead or crossing branches. Proper watering and fertilization based on soil tests will also contribute to overall tree vigor.",
    "organic": ""
  },
  "blueberry healthy": {
    "name": "Healthy Blueberry",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "Maintaining a healthy blueberry plant involves ensuring optimal growing conditions. This includes providing excellent soil drainage, as blueberries are sensitive to waterlogging, and maintaining the ideal acidic soil pH (typically between 4.5 and 5.5). Regular monitoring for any signs of nutrient deficiencies or pest issues, along with appropriate watering during dry periods, will promote vigorous growth and fruit production.",
    "organic": ""
  },
  "cherry including sour powdery mildew": {
    "name": "Cherry Powdery Mildew",
    "treatment": "Use fungicide; improve air flow.",
    "chemical": "Sulfur, Potassium bicarbonate",
    "application": "Fungicide applications should begin at the first visible signs of powdery mildew, typically appearing as white, powdery patches on leaves or fruit. Ensure thorough coverage of all affected plant parts. In addition to chemical control, cultural practices are vital: improve air circulation around and within the cherry trees through strategic pruning and proper plant spacing to reduce humidity, which favors disease development.",
    "organic": "Baking soda + water spray"
  },
  "cherry including sour healthy": {
    "name": "Healthy Cherry",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To keep cherry trees healthy, regular monitoring is key. Periodically inspect leaves, stems, and fruit for any discoloration, spots, or abnormal growth that might indicate pest or disease issues. Consistent watering, especially during dry spells, and appropriate pruning practices will support overall tree health and productivity.",
    "organic": ""
  },
  "corn maize cercospora leaf spot gray leaf spot": {
    "name": "Corn Gray Leaf Spot (Cercospora)",
    "treatment": "Apply fungicide and rotate crops.",
    "chemical": "Azoxystrobin, Pyraclostrobin",
    "application": "Fungicide application for Corn Gray Leaf Spot is most effective when applied preventively or at the earliest signs of disease development, typically around the tassel stage (VT) to silking stage (R1) of corn growth, especially if conditions are humid and warm. It's crucial to ensure good coverage of the foliage. Additionally, implementing crop rotation with non-host crops and selecting resistant corn hybrids can significantly reduce disease pressure.",
    "organic": "None effective"
  },
  "corn maize common rust": {
    "name": "Corn Common Rust",
    "treatment": "Spray fungicide at early sign.",
    "chemical": "Propiconazole, Azoxystrobin",
    "application": "For Corn Common Rust, a preventive fungicide spray can be beneficial during early growth stages if rust has been a historical problem in the area or if environmental conditions (cool, wet weather) are conducive to its development. If not applied preventively, spray at the very first signs of rust pustules appearing on the leaves. Timely application is crucial to limit the spread and impact of the disease on yield.",
    "organic": "Plant resistant hybrids"
  },
  "corn maize northern leaf blight": {
    "name": "Corn Northern Leaf Blight",
    "treatment": "Apply foliar fungicide and practice rotation.",
    "chemical": "Chlorothalonil",
    "application": "Foliar fungicides should be applied when Northern Leaf Blight lesions first appear on the corn leaves, particularly if the disease is developing rapidly and favorable conditions (cool, humid) persist. Ensure thorough coverage of the plant foliage. Crop rotation with non-host crops is a critical cultural practice to break the disease cycle and reduce inoculum levels in the field for subsequent seasons.",
    "organic": "Compost tea (less effective)"
  },
  "corn maize healthy": {
    "name": "Healthy Corn",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain healthy corn, continue practicing good field hygiene. This includes proper residue management to reduce overwintering pathogens, judicious irrigation practices, and monitoring for nutrient deficiencies. Regular scouting for any emerging pests or diseases will allow for early detection and intervention if necessary, ensuring a robust and productive crop.",
    "organic": ""
  },
  "grape black rot": {
    "name": "Grape Black Rot",
    "treatment": "Remove mummified fruit and spray fungicide.",
    "chemical": "Captan, Myclobutanil",
    "application": "Effective management of Grape Black Rot involves a combination of sanitation and fungicide applications. Begin by removing all mummified fruit from the vines and vineyard floor during dormancy to eliminate overwintering inoculum. During the growing season, particularly in wet periods, apply fungicides every 10 to 14 days, starting from bloom and continuing through veraison (color change). Focus on achieving thorough coverage, especially on new shoots and fruit clusters.",
    "organic": "Copper spray"
  },
  "grape esca black measles": {
    "name": "Grape Esca (Black Measles)",
    "treatment": "Prune infected vines and apply fungicide.",
    "chemical": "Thiophanate-methyl",
    "application": "For Grape Esca, the primary application method is to treat pruning wounds immediately after making cuts, especially larger ones. Thiophanate-methyl or other recommended fungicides should be applied directly to the fresh wound to prevent the entry of fungal spores. Additionally, removal of severely infected vines can help limit the spread of the disease within the vineyard. Always ensure proper sanitation of pruning tools to avoid spreading the pathogen.",
    "organic": "None known"
  },
  "grape leaf blight isariopsis leaf spot": {
    "name": "Grape Leaf Blight (Isariopsis)",
    "treatment": "Use copper-based fungicide.",
    "chemical": "Copper oxychloride",
    "application": "Apply copper-based fungicides when Grape Leaf Blight symptoms, such as small, angular leaf spots, first become apparent. Applications should focus on covering the foliage, particularly the undersides of leaves where fungal growth might be present. Repeat applications may be necessary, especially during periods of high humidity or frequent rainfall, to maintain protective coverage and prevent further spread of the disease.",
    "organic": "Copper-based organic formulations"
  },
  "grape healthy": {
    "name": "Healthy Grape",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "Maintaining healthy grapevines includes meticulous canopy management to ensure good light penetration and air circulation, which helps prevent many fungal diseases. Regular pruning, proper trellising, and timely removal of suckers and excess foliage are essential. Consistent monitoring for any signs of stress, pests, or disease will allow for prompt intervention and ensure a productive vineyard.",
    "organic": ""
  },
  "orange haunglongbing citrus greening": {
    "name": "Citrus Greening (Huanglongbing)",
    "treatment": "Control psyllid vector and remove infected trees.",
    "chemical": "Imidacloprid (insecticide)",
    "application": "The primary approach to managing Citrus Greening is through aggressive control of the Asian citrus psyllid, the insect vector that transmits the disease. Systemic insecticides like Imidacloprid can be applied to the soil for root uptake or as foliar sprays to target the psyllids. Applications should be timed to coincide with psyllid population peaks. Additionally, immediate removal of symptomatic and confirmed infected trees is crucial to reduce the source of inoculum and prevent further spread of the disease.",
    "organic": "Neem oil (limited efficacy)"
  },
  "peach bacterial spot": {
    "name": "Peach Bacterial Spot",
    "treatment": "Use copper sprays and prune regularly.",
    "chemical": "Copper sulfate",
    "application": "Apply copper sprays during the dormant season after leaf fall to reduce overwintering bacterial populations. In early spring, just before bud swell, another application can provide some protection. During the growing season, repeated applications may be needed, especially after rainfall, but be mindful of potential phytotoxicity with copper on young foliage. Regular pruning to improve air circulation and remove heavily infected branches can also help manage the disease.",
    "organic": "Fixed copper sprays"
  },
  "peach healthy": {
    "name": "Healthy Peach",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To ensure a healthy peach tree, regular monitoring for any signs of disease or pests is essential. Consistent pruning practices, including thinning fruit and removing dead or diseased wood, will promote good air circulation and overall tree vigor. Proper irrigation and nutrient management will also contribute to robust growth and abundant harvests.",
    "organic": ""
  },
  "pepper bell bacterial spot": {
    "name": "Pepper Bacterial Spot",
    "treatment": "Use copper-based spray and avoid overhead watering.",
    "chemical": "Copper hydroxide",
    "application": "Begin applying copper hydroxide sprays weekly, starting shortly after transplanting, to provide protective coverage against bacterial spot. Ensure thorough coverage of all leaf surfaces, especially new growth. It is critical to avoid overhead watering, as splashing water can spread the bacteria. Instead, use drip irrigation or water at the base of the plants to keep foliage dry. Remove and destroy any infected plant material immediately to prevent further spread.",
    "organic": "Fixed copper"
  },
  "pepper bell healthy": {
    "name": "Healthy Pepper",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain healthy bell pepper plants, ensure the soil is consistently well-drained to prevent root issues. Provide adequate sunlight and consistent watering, especially during flowering and fruit set. Regularly monitor plants for any signs of pests or nutrient deficiencies and practice good garden hygiene by removing any debris or weeds that could harbor pathogens.",
    "organic": ""
  },
  "potato early blight": {
    "name": "Potato Early Blight",
    "treatment": "Apply fungicide and rotate crops.",
    "chemical": "Chlorothalonil, Mancozeb",
    "application": "Fungicide applications for Potato Early Blight should commence at the first appearance of symptoms, typically small, dark spots with concentric rings on lower leaves, often associated with yellowing. Continue applications every 7-10 days, or as per product label recommendations, especially during periods of high humidity and moderate temperatures. Crop rotation with non-solanaceous crops is crucial to break the disease cycle and reduce inoculum in the soil.",
    "organic": "Copper or neem oil"
  },
  "potato late blight": {
    "name": "Potato Late Blight",
    "treatment": "Use protective fungicide and remove infected plants.",
    "chemical": "Mancozeb, Copper",
    "application": "Potato Late Blight requires aggressive preventive measures, especially during cool, moist periods that favor its development. Begin protective fungicide sprays before symptoms appear if conditions are conducive, or immediately at the very first confirmed sighting of the disease in your area. Ensure thorough coverage of all foliage. Promptly remove and destroy all infected plant material (leaves, stems, tubers) to prevent the rapid spread of this highly destructive disease.",
    "organic": "Copper fungicide"
  },
  "potato healthy": {
    "name": "Healthy Potato",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain healthy potato plants, continuous monitoring for any signs of disease or pest infestations is important. Applying a layer of straw mulch can help regulate soil temperature, conserve moisture, and suppress weeds. Ensure proper hilling as tubers develop to prevent greening and protect them from light and pests.",
    "organic": ""
  },
  "raspberry healthy": {
    "name": "Healthy Raspberry",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "For healthy raspberry canes, ensure excellent air circulation by proper spacing and regular pruning. Remove old, spent canes after fruiting, and thin new canes to prevent overcrowding. This open canopy design reduces humidity and helps prevent many fungal issues. Regular watering and adequate sunlight exposure are also crucial for vigorous growth and fruit production.",
    "organic": ""
  },
  "soybean healthy": {
    "name": "Healthy Soybean",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain healthy soybean crops, implement a robust crop rotation strategy with non-host plants to disrupt disease cycles and improve soil health. Regular field monitoring is essential to detect any emerging pest or disease issues early, allowing for timely and targeted interventions if necessary. Ensure proper nutrient management and weed control for optimal plant vigor.",
    "organic": ""
  },
  "squash powdery mildew": {
    "name": "Squash Powdery Mildew",
    "treatment": "Apply sulfur-based or potassium bicarbonate fungicide.",
    "chemical": "Sulfur",
    "application": "Fungicide application for Squash Powdery Mildew should begin at the first appearance of white, powdery spots on leaves and stems. Ensure thorough coverage, especially on the undersides of leaves. Repeat applications every 7-14 days or as directed by the product label, particularly in warm, humid conditions. Improving air circulation around plants by proper spacing and pruning can also help reduce disease severity.",
    "organic": "Milk spray, neem oil"
  },
  "strawberry leaf scorch": {
    "name": "Strawberry Leaf Scorch",
    "treatment": "Remove infected leaves and spray fungicide.",
    "chemical": "Captan",
    "application": "To manage Strawberry Leaf Scorch, begin by removing and destroying any severely infected leaves after harvest to reduce overwintering inoculum. In early spring, before new growth fully emerges, and potentially again after harvest, apply a recommended fungicide such as Captan. Ensure thorough coverage of the foliage. Good cultural practices, including proper plant spacing and watering to minimize leaf wetness, also contribute to control.",
    "organic": "Compost tea, copper"
  },
  "strawberry healthy": {
    "name": "Healthy Strawberry",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To keep strawberries healthy, applying a layer of straw mulch around the plants is highly beneficial. This helps suppress weeds, conserves soil moisture, keeps berries clean, and insulates the plants during colder temperatures. Regular watering, especially during fruit development, and monitoring for any pests or early signs of disease will also contribute to a bountiful harvest.",
    "organic": ""
  },
  "tomato bacterial spot": {
    "name": "Tomato Bacterial Spot",
    "treatment": "Use copper spray and destroy infected plants.",
    "chemical": "Copper hydroxide",
    "application": "Begin weekly applications of copper hydroxide spray after transplanting and continue throughout the growing season, especially during periods of wet weather. Ensure thorough coverage of all foliage. It is crucial to avoid overhead watering, as splashing water can easily spread the bacteria from plant to plant. Immediately remove and destroy any severely infected plants or plant parts to prevent further spread within the crop.",
    "organic": "Fixed copper"
  },
  "tomato early blight": {
    "name": "Tomato Early Blight",
    "treatment": "Apply fungicide and prune lower leaves.",
    "chemical": "Chlorothalonil",
    "application": "Fungicide applications for Tomato Early Blight should commence when symptoms first appear, typically on the lower leaves, or preventively if the disease is common in your area. Apply sprays every 7–10 days, ensuring complete coverage of the foliage. Additionally, prune off any lower leaves that are touching the soil or showing early signs of infection, as these can be a source of primary inoculum. Crop rotation and good sanitation are also vital.",
    "organic": "Compost tea, copper"
  },
  "tomato late blight": {
    "name": "Tomato Late Blight",
    "treatment": "Destroy infected foliage and apply fungicide.",
    "chemical": "Mancozeb",
    "application": "Tomato Late Blight is highly destructive and requires immediate action. Begin protective fungicide sprays preventively if conditions are cool and moist and late blight has been reported in your region. If symptoms appear, apply fungicides aggressively and immediately remove and destroy all infected foliage, stems, and fruits to prevent rapid spread. Never compost infected plant material. Ensure excellent air circulation and avoid overhead watering.",
    "organic": "Copper fungicide"
  },
  "tomato leaf mold": {
    "name": "Tomato Leaf Mold",
    "treatment": "Use copper fungicide and increase ventilation.",
    "chemical": "Copper-based fungicide",
    "application": "Apply copper-based fungicides when Tomato Leaf Mold symptoms are first observed, focusing on the undersides of leaves where the mold often develops. Spraying in the morning allows the foliage to dry quickly, which is crucial for disease management. Significantly increase ventilation in greenhouses or high tunnels by opening vents and spacing plants adequately to reduce humidity, which favors leaf mold development.",
    "organic": "Neem oil"
  },
  "tomato septoria leaf spot": {
    "name": "Tomato Septoria Leaf Spot",
    "treatment": "Apply fungicide and remove infected leaves.",
    "chemical": "Chlorothalonil, Copper",
    "application": "Begin fungicide applications for Tomato Septoria Leaf Spot at the time of fruit set or when the first small, dark spots with tan centers appear on lower leaves. Continue applications every 7-10 days, ensuring thorough coverage of the foliage. Regularly remove and destroy any infected leaves, especially those close to the soil, to reduce the spread of spores. Avoid overhead watering to minimize splashing.",
    "organic": "Baking soda spray"
  },
  "tomato spider mites two spotted spider mite": {
    "name": "Tomato Spider Mites",
    "treatment": "Use miticide or insecticidal soap.",
    "chemical": "Abamectin, horticultural oil",
    "application": "For Tomato Spider Mites, thorough application of miticides or insecticidal soaps is essential. Focus on spraying the undersides of leaves, where mites typically reside and lay eggs. Repeat applications may be necessary every 5-7 days until the population is under control, as these products often only affect certain life stages. Maintaining good plant hydration can also help plants tolerate minor infestations.",
    "organic": "Neem oil"
  },
  "tomato target spot": {
    "name": "Tomato Target Spot",
    "treatment": "Apply fungicide and rotate crops.",
    "chemical": "Chlorothalonil",
    "application": "Fungicide applications for Tomato Target Spot should begin at the first appearance of lesions, which typically have a distinct bull's-eye pattern. Apply recommended fungicides, such as chlorothalonil, ensuring good coverage of the foliage. Continue applications as per label instructions, especially in warm, humid conditions. Practicing crop rotation with non-solanaceous crops is crucial to reduce the build-up of the pathogen in the soil.",
    "organic": "Copper fungicide"
  },
  "tomato tomato yellow leaf curl virus": {
    "name": "Tomato Yellow Leaf Curl Virus",
    "treatment": "Remove infected plants and control whiteflies.",
    "chemical": "Imidacloprid (whitefly control)",
    "application": "The primary strategy for Tomato Yellow Leaf Curl Virus is rigorous control of its whitefly vector. Systemic insecticides like Imidacloprid can be applied to the soil or as foliar sprays to manage whitefly populations effectively. Application timing should target whitefly generations. Critically, immediately remove and destroy any plants showing symptoms of the virus (yellowing, stunted growth, upward curling leaves) to eliminate sources of the virus for whiteflies to transmit to healthy plants. Use reflective mulches and row covers to deter whiteflies.",
    "organic": "Yellow sticky traps, neem oil"
  },
  "tomato tomato mosaic virus": {
    "name": "Tomato Mosaic Virus",
    "treatment": "Remove plants; disinfect tools and hands.",
    "chemical": "None",
    "application": "There is no chemical treatment for Tomato Mosaic Virus. Prevention is paramount: immediately remove and destroy any infected plants to prevent the spread of the virus. Meticulously disinfect all gardening tools, stakes, and even hands thoroughly with a bleach solution or rubbing alcohol after handling any suspicious plants, as the virus is highly transmissible mechanically. Avoid using tobacco products while handling plants, as the virus can be carried on tobacco.",
    "organic": "None"
  },
  "tomato healthy": {
    "name": "Healthy Tomato",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "To maintain healthy tomato plants, consistently practice good field hygiene, including promptly removing any plant debris and rotating crops annually to different beds. Ensure proper spacing between plants for good air circulation, and use clean, disinfected tools for pruning and harvesting. Consistent watering at the base of the plant, avoiding overhead irrigation, also helps prevent many foliar diseases.",
    "organic": ""
  },
  "background": {
    "name": "Background",
    "treatment": "No treatment needed.",
    "chemical": "",
    "application": "N/A",
    "organic": ""
  }
}
